[Killed] ArrayDeclaration
main/components/Restaurants/RestaurantTable.jsx:37:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id", // accessor is the "key" in the data
-    },
-
-    {
-      Header: "Name",
-      accessor: "name",
-    },
-    {
-      Header: "Description",
-      accessor: "description",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: RestaurantTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
