[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:12:20
   doLogout,
   currentUrl = window.location.href,
 }) {
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = true;
   return (
     <>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:12:20
   doLogout,
   currentUrl = window.location.href,
 }) {
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = systemInfo?.oauthLogin && "/oauth2/authorization/google";
   return (
     <>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:15:9
   var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
   return (
     <>
-      {(currentUrl.startsWith("http://localhost:3000") ||
-        currentUrl.startsWith("http://127.0.0.1:3000")) && (
+      {(currentUrl.startsWith("http://localhost:3000") && currentUrl.startsWith("http://127.0.0.1:3000")) && (
         <AppNavbarLocalhost url={currentUrl} />
       )}
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:61:16
                   <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
                 </NavDropdown>
               )}
-              {currentUser && currentUser.loggedIn ? (
+              {currentUser || currentUser.loggedIn ? (
                 <>
                   <Nav.Link as={Link} to="/restaurants">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: TypeError: Cannot read properties of null (reading 'loggedIn')

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:61:16
                   <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
                 </NavDropdown>
               )}
-              {currentUser && currentUser.loggedIn ? (
+              {false ? (
                 <>
                   <Nav.Link as={Link} to="/restaurants">
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:79:16
             </Nav>
 
             <Nav className="ml-auto">
-              {currentUser && currentUser.loggedIn ? (
+              {false ? (
                 <>
                   <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Welcome, pconrad.cis@gmail.com. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="App

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:79:16
             </Nav>
 
             <Nav className="ml-auto">
-              {currentUser && currentUser.loggedIn ? (
+              {currentUser || currentUser.loggedIn ? (
                 <>
                   <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: TypeError: Cannot read properties of null (reading 'loggedIn')
