[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:16:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsbdates/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdates/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:40:17
     },
     {
       Header: "QuarterYYYYQ",
-      accessor: "quarterYYYYQ",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-quarterYYYYQ"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
