[Killed] ArrayDeclaration
main/components/Users/UsersTable.jsx:3:17
 import OurTable from "main/components/OurTable";
 
-const columns = [
-  {
-    Header: "id",
-    accessor: "id", // accessor is the "key" in the data
-  },
-  {
-    Header: "First Name",
-    accessor: "givenName",
-  },
-  {
-    Header: "Last Name",
-    accessor: "familyName",
-  },
-  {
-    Header: "Email",
-    accessor: "email",
-  },
-  {
-    Header: "Admin",
-    id: "admin",
-    accessor: (row, _rowIndex) => String(row.admin), // hack needed for boolean values to show up
-  },
-];
+const columns = [];
 
 export default function UsersTable({ users }) {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:14:15
   },
   {
     Header: "Last Name",
-    accessor: "familyName",
+    accessor: "",
   },
   {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-familyName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:20:3
     Header: "Email",
     accessor: "email",
   },
-  {
-    Header: "Admin",
-    id: "admin",
-    accessor: (row, _rowIndex) => String(row.admin), // hack needed for boolean values to show up
-  },
+  {},
 ];
 
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: A column ID (or string accessor) is required!
