[Killed] ArrayDeclaration
src/main/components/OurTable.jsx:14:44
 
 
 function OurTable({ data, columns, testid = "testid" }) {
-  const memoizedData = useMemo(() => data, [data]);
+  const memoizedData = useMemo(() => data, []);
   const memoizedColumns = useMemo(() => columns, [columns]);
 
killedBy: UCSBDatesIndexPage tests renders three dates correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
