[Killed] ArrowFunction
src/main/components/OurTable.jsx:13:32
 import SortCaret from "main/components/Common/SortCaret";
 
 function OurTable({ data, columns, testid = "testid" }) {
-  const memoizedData = useMemo(() => data, [data]);
+  const memoizedData = useMemo(() => undefined, [data]);
   const memoizedColumns = useMemo(() => columns, [columns]);
 
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/main/components/OurTable.jsx:14:35
 
 function OurTable({ data, columns, testid = "testid" }) {
   const memoizedData = useMemo(() => data, [data]);
-  const memoizedColumns = useMemo(() => columns, [columns]);
+  const memoizedColumns = useMemo(() => undefined, [columns]);
 
   const table = useReactTable({
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
src/main/components/OurTable.jsx:28:26
       <thead>
         {table.getHeaderGroups().map((headerGroup, i) => (
           <tr
-            data-testid={`${testid}-header-group-${i}`}
+            data-testid={``}
             // Stryker disable next-line StringLiteral : React key property not exposed in dom
             key={`${testid}-header-group-${i}`}
killedBy: OurTable tests OurTable component tests renders a table with three rows with correct test ids
statusReason: Error: Unable to find an element by: [data-testid="testid-header-group-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="testid"

[Killed] ArrowFunction
src/main/components/OurTable.jsx:32:38
             // Stryker disable next-line StringLiteral : React key property not exposed in dom
             key={`${testid}-header-group-${i}`}
           >
-            {headerGroup.headers.map((header) => (
-              <th
-                data-testid={`${testid}-header-${header.column.id}`}
-                key={`${testid}-header-${header.column.id}`}
-                colSpan={header.colSpan}
-              >
-                {header.isPlaceholder ? null : (
-                  <div
-                    // Add onClick handler for sorting if the column is sortable
-                    {...(header.column.getCanSort() && {
-                      onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: "pointer" }, // Add cursor style for visual cue
-                    })}
-                    data-testid={`${testid}-header-${header.column.id}-sort-header`}
-                  >
-                    {flexRender(
-                      header.column.columnDef.header,
-                      header.getContext(),
-                    )}
-                    <SortCaret header={header} testId={testid} />
-                  </div>
-                )}
-              </th>
-            ))}
+            {headerGroup.headers.map(() => undefined)}
           </tr>
         ))}
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDatesTable"

[Killed] StringLiteral
src/main/components/OurTable.jsx:34:30
           >
             {headerGroup.headers.map((header) => (
               <th
-                data-testid={`${testid}-header-${header.column.id}`}
+                data-testid={``}
                 key={`${testid}-header-${header.column.id}`}
                 colSpan={header.colSpan}
killedBy: OurTable tests OurTable component tests renders a table with three rows with correct test ids
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="testid"

[Killed] StringLiteral
src/main/components/OurTable.jsx:35:22
             {headerGroup.headers.map((header) => (
               <th
                 data-testid={`${testid}-header-${header.column.id}`}
-                key={`${testid}-header-${header.column.id}`}
+                key={``}
                 colSpan={header.colSpan}
               >
killedBy: RestaurantIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/restaurants/all"
Received string:    "Encountered two children with the same key, `%s`. Keys should be unique so that components maintain their identity across updates. Non-unique keys may cause children to be duplicated and/or omitted — the behavior is unsupported and could change in a

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:41:26
                 {header.isPlaceholder ? null : (
                   <div
                     // Add onClick handler for sorting if the column is sortable
-                    {...(header.column.getCanSort() && {
-                      onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: "pointer" }, // Add cursor style for visual cue
-                    })}
+                    {...(true)}
                     data-testid={`${testid}-header-${header.column.id}-sort-header`}
                   >
killedBy: OurTable tests OurTable component tests placeholder headers work properly
statusReason: Error: expect(element).toHaveAttribute("style", "cursor: pointer;") // element.getAttribute("style") === "cursor: pointer;"

Expected the element to have attribute:
  style="cursor: pointer;"
Received:
  null

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:41:26
                 {header.isPlaceholder ? null : (
                   <div
                     // Add onClick handler for sorting if the column is sortable
-                    {...(header.column.getCanSort() && {
-                      onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: "pointer" }, // Add cursor style for visual cue
-                    })}
+                    {...(false)}
                     data-testid={`${testid}-header-${header.column.id}-sort-header`}
                   >
killedBy: OurTable tests OurTable component tests placeholder headers work properly
statusReason: Error: expect(element).toHaveAttribute("style", "cursor: pointer;") // element.getAttribute("style") === "cursor: pointer;"

Expected the element to have attribute:
  style="cursor: pointer;"
Received:
  null

[Killed] BlockStatement
src/main/components/OurTable.jsx:60:48
         ))}
       </thead>
       <tbody>
-        {table.getRowModel().rows.map((row) => {
-          const rowTestId = `${testid}-row-${row.index}`;
-          return (
-            <tr
-              data-testid={rowTestId}
-              // Stryker disable next-line StringLiteral : React key property not exposed in dom
-              key={rowTestId}
-            >
-              {row.getVisibleCells().map((cell) => {
-                const testId = `${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`;
-                return (
-                  <td
-                    data-testid={testId}
-                    // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                    key={testId}
-                  >
-                    {flexRender(cell.column.columnDef.cell, cell.getContext())}
-                  </td>
-                );
-              })}
-            </tr>
-          );
-        })}
+        {table.getRowModel().rows.map((row) => {})}
       </tbody>
     </table>
killedBy: OurTable tests OurTable component tests renders a table with three rows with correct test ids
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="testid-row-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="testid"

[Killed] BlockStatement
src/main/components/OurTable.jsx:68:52
               // Stryker disable next-line StringLiteral : React key property not exposed in dom
               key={rowTestId}
             >
-              {row.getVisibleCells().map((cell) => {
-                const testId = `${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`;
-                return (
-                  <td
-                    data-testid={testId}
-                    // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                    key={testId}
-                  >
-                    {flexRender(cell.column.columnDef.cell, cell.getContext())}
-                  </td>
-                );
-              })}
+              {row.getVisibleCells().map((cell) => {})}
             </tr>
           );
killedBy: OurTable tests OurTable component tests The button appears in the table
statusReason: Error: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="testid"

[Killed] BlockStatement
src/main/components/OurTable.jsx:90:64
 
 export default OurTable;
 
-export function ButtonColumn(label, variant, callback, testid) {
-  const columnHelper = createColumnHelper();
-
-  const buttonColumn = columnHelper.display({
-    id: label, // Unique ID for display columns
-    header: label,
-    cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    ),
-  });
-  return buttonColumn;
-}
+export function ButtonColumn(label, variant, callback, testid) {}
 
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: Error: Columns require an id when using a non-string header

[Killed] ArrowFunction
src/main/components/OurTable.jsx:96:11
   const buttonColumn = columnHelper.display({
     id: label, // Unique ID for display columns
     header: label,
-    cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    ),
+    cell: () => undefined,
   });
   return buttonColumn;
killedBy: UCSBDatesIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
