[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.jsx:8:17
 function RestaurantForm({
   initialContents,
   submitAction,
-  buttonLabel = "Create",
+  buttonLabel = "",
 }) {
   // Stryker disable all
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.jsx:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "RestaurantForm";
+  const testIdPrefix = "";
 
   return (
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Restaurants/RestaurantForm.jsx:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, name, description}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Restaurants/RestaurantForm.jsx:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: RestaurantForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.jsx:31:26
             data-testid={testIdPrefix + "-id"}
             id="id"
             type="text"
-            {...register("id")}
+            {...register("")}
             value={initialContents.id}
             disabled
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Restaurants/RestaurantForm.jsx:54:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.name?.message}
+          {errors.name.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RestaurantForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.jsx:65:24
           id="description"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("description", {
+          {...register("", {
             required: "Description is required.",
           })}
killedBy: RestaurantForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Restaurants/RestaurantForm.jsx:70:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.description?.message}
+          {errors.description.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] UnaryOperator
main/components/Restaurants/RestaurantForm.jsx:79:33
       </Button>
       <Button
         variant="Secondary"
-        onClick={() => navigate(-1)}
+        onClick={() => navigate(+1)}
         data-testid={testIdPrefix + "-cancel"}
       >
killedBy: RestaurantForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Restaurants/RestaurantForm.jsx:79:18
       </Button>
       <Button
         variant="Secondary"
-        onClick={() => navigate(-1)}
+        onClick={() => undefined}
         data-testid={testIdPrefix + "-cancel"}
       >
killedBy: RestaurantForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0

Ignored nodes: comments, script, style
<html>
