[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/restaurants/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/edit/2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrayDeclaration
main/components/Restaurants/RestaurantTable.jsx:37:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "id",
-      accessorKey: "id", // accessor is the "key" in the data
-    },
-
-    {
-      header: "Name",
-      accessorKey: "name",
-    },
-    {
-      header: "Description",
-      accessorKey: "description",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: RestaurantTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RestaurantTable"

[Killed] ConditionalExpression
main/components/Restaurants/RestaurantTable.jsx:53:7
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
+  if (true) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: RestaurantTable tests Has the expected column headers, content for ordinary user
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="RestaurantTable-header-Delete-sort-header"
>

[Killed] ConditionalExpression
main/components/Restaurants/RestaurantTable.jsx:53:7
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
+  if (false) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: RestaurantTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RestaurantTable"

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.jsx:54:39
   ];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
+    columns.push(ButtonColumn("Edit", "", editCallback, testIdPrefix));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: RestaurantTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
