[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.jsx:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDateForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDateForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.jsx:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDateForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDateForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/UCSBDates/UCSBDateForm.jsx:58:44
               id="quarterYYYYQ"
               type="text"
               isInvalid={Boolean(errors.quarterYYYYQ)}
-              {...register("quarterYYYYQ", {
-                required: true,
-                pattern: yyyyq_regex,
-              })}
+              {...register("quarterYYYYQ", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBDateForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /QuarterYYYYQ must be in the format YYYYQ/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBDates/UCSBDateForm.jsx:59:27
               type="text"
               isInvalid={Boolean(errors.quarterYYYYQ)}
               {...register("quarterYYYYQ", {
-                required: true,
+                required: false,
                 pattern: yyyyq_regex,
               })}
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /QuarterYYYYQ is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.jsx:64:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.quarterYYYYQ && "QuarterYYYYQ is required. "}
+              {false}
               {errors.quarterYYYYQ?.type === "pattern" &&
                 "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /QuarterYYYYQ is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.jsx:64:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.quarterYYYYQ && "QuarterYYYYQ is required. "}
+              {true}
               {errors.quarterYYYYQ?.type === "pattern" &&
                 "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /QuarterYYYYQ is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/UCSBDates/UCSBDateForm.jsx:65:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.quarterYYYYQ && "QuarterYYYYQ is required. "}
-              {errors.quarterYYYYQ?.type === "pattern" &&
+              {errors.quarterYYYYQ?.type !== "pattern" &&
                 "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
             </Form.Control.Feedback>
killedBy: UCSBDateForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022</div> instead

[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.jsx:65:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.quarterYYYYQ && "QuarterYYYYQ is required. "}
-              {errors.quarterYYYYQ?.type === "pattern" &&
-                "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDateForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /QuarterYYYYQ must be in the format YYYYQ/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBDates/UCSBDateForm.jsx:79:27
               type="datetime-local"
               isInvalid={Boolean(errors.localDateTime)}
               {...register("localDateTime", {
-                required: true,
+                required: false,
                 pattern: isodate_regex,
               })}
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.jsx:84:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.localDateTime && "LocalDateTime is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBDates/UCSBDateForm.jsx:84:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.localDateTime && "LocalDateTime is required. "}
+              {errors.localDateTime || "LocalDateTime is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDateForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ObjectLiteral
main/components/UCSBDates/UCSBDateForm.jsx:99:36
               id="name"
               type="text"
               isInvalid={Boolean(errors.name)}
-              {...register("name", {
-                required: "Name is required.",
-              })}
+              {...register("name", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
