[Killed] BlockStatement
main/components/UCSBDates/UCSBDatesTable.jsx:15:34
 export default function UCSBDatesTable({ dates, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsbdates/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdates/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:16:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsbdates/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdates/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:34:5
   };
 
   const columns = [
-    {
-      header: "id",
-      accessorKey: "id", // accessor is the "key" in the data
-    },
+    {},
     {
       header: "QuarterYYYYQ",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:35:15
 
   const columns = [
     {
-      header: "id",
+      header: "",
       accessorKey: "id", // accessor is the "key" in the data
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDatesTable"

[Killed] ObjectLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:38:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "QuarterYYYYQ",
-      accessorKey: "quarterYYYYQ",
-    },
+    {},
     {
       header: "Name",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:47:15
       accessorKey: "name",
     },
     {
-      header: "Date",
+      header: "",
       accessorKey: "localDateTime",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDatesTable"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:48:20
     },
     {
       header: "Date",
-      accessorKey: "localDateTime",
+      accessorKey: "",
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-localDateTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDatesTable"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:54:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBDatesTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDatesTable"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:54:28
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBDatesTable"),
+      ButtonColumn("Edit", "", editCallback, "UCSBDatesTable"),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
