[Killed] BooleanLiteral
main/pages/Restaurants/RestaurantCreatePage.jsx:7:60
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function RestaurantCreatePage({ storybook = false }) {
+export default function RestaurantCreatePage({ storybook = true }) {
   const objectToAxiosParams = (restaurant) => ({
     url: "/api/restaurants/post",
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/restaurants"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/Restaurants/RestaurantCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function RestaurantCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (restaurant) => ({
-    url: "/api/restaurants/post",
-    method: "POST",
-    params: {
-      name: restaurant.name,
-      description: restaurant.description,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.jsx:17:37
     },
   });
 
-  const onSuccess = (restaurant) => {
-    toast(
-      `New restaurant Created - id: ${restaurant.id} name: ${restaurant.name}`,
-    );
-  };
+  const onSuccess = (restaurant) => {};
 
   const mutation = useBackendMutation(
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New restaurant Created - id: 3 name: South Coast Deli"

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantCreatePage.jsx:25:5
 
   const mutation = useBackendMutation(
     objectToAxiosParams,
-    { onSuccess },
+    {},
     // Stryker disable next-line all : hard to set up test for caching
     ["/api/restaurants/all"], // mutation makes this key stale so that pages relying on it reload
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New restaurant Created - id: 3 name: South Coast Deli"

Number of calls: 0

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.jsx:32:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    mutation.mutate(data);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess && !storybook) {
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantCreatePage.jsx:36:7
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
+  if (false) {
     return <Navigate to="/restaurants" />;
   }
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/restaurants"}

Number of calls: 0

[Killed] BooleanLiteral
main/pages/Restaurants/RestaurantCreatePage.jsx:36:20
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
+  if (isSuccess && storybook) {
     return <Navigate to="/restaurants" />;
   }
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/restaurants"}

Number of calls: 0
