[Killed] BooleanLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:8:58
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function RestaurantEditPage({ storybook = false }) {
+export default function RestaurantEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/restaurants"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/restaurants?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/restaurants`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Restaurants/RestaurantEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: "/api/restaurants",
-    method: "PUT",
-    params: {
-      id: restaurant.id,
-    },
-    data: {
-      name: restaurant.name,
-      description: restaurant.description,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Freebirds World Burrito"
Received: "Error: Request failed with status code 404"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:28:51
     },
   );
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: "/api/restaurants",
-    method: "PUT",
-    params: {
-      id: restaurant.id,
-    },
-    data: {
-      name: restaurant.name,
-      description: restaurant.description,
-    },
-  });
+  const objectToAxiosPutParams = (restaurant) => ({});
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Freebirds World Burrito"
Received: "Error: Request failed with status code 404"

Number of calls: 1

[Killed] StringLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (restaurant) => ({
-    url: "/api/restaurants",
+    url: "",
     method: "PUT",
     params: {
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Freebirds World Burrito"
Received: "Error: Request failed with status code 404"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:31:13
   const objectToAxiosPutParams = (restaurant) => ({
     url: "/api/restaurants",
     method: "PUT",
-    params: {
-      id: restaurant.id,
-    },
+    params: {},
     data: {
       name: restaurant.name,
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.jsx:40:37
     },
   });
 
-  const onSuccess = (restaurant) => {
-    toast(`Restaurant Updated - id: ${restaurant.id} name: ${restaurant.name}`);
-  };
+  const onSuccess = (restaurant) => {};
 
   const mutation = useBackendMutation(
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:41:11
   });
 
   const onSuccess = (restaurant) => {
-    toast(`Restaurant Updated - id: ${restaurant.id} name: ${restaurant.name}`);
+    toast(``);
   };
 
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Freebirds World Burrito"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.jsx:57:7
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
+  if (true) {
     return <Navigate to="/restaurants" />;
   }
killedBy: RestaurantEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: Unable to find an element with the text: Edit Restaurant. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.jsx:65:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
-        {restaurant && (
-          <RestaurantForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={restaurant}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Restaurants/RestaurantEditPage.jsx:65:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
-        {restaurant && (
-          <RestaurantForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={restaurant}
-          />
-        )}
+        {restaurant || <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={restaurant} />}
       </div>
     </BasicLayout>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, name, description}). If you meant to render a collection of children, use an array instead.
