[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.jsx:19:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/restaurants/all"],
-    { method: "GET", url: "/api/restaurants/all" },
+    { method: "", url: "/api/restaurants/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: RestaurantIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/restaurants/all"
Received string:    "Error communicating with backend via  on /api/restaurants/all"

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantIndexPage.jsx:19:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/restaurants/all"],
-    { method: "GET", url: "/api/restaurants/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: RestaurantIndexPage tests renders three restaurants correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.jsx:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/restaurants/create"
-          style={{ float: "right" }}
-        >
-          Create Restaurant
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Restaurant/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantIndexPage.jsx:25:9
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
+    if (true) {
       return (
         <Button
killedBy: RestaurantIndexPage tests renders three restaurants correctly for regular user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="btn btn-primary" href="/restaurants/create" role="button" style="float: right;" tabindex="0">Create Restaurant</a> instead

[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.jsx:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/restaurants/create"
-          style={{ float: "right" }}
-        >
-          Create Restaurant
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Restaurant/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
