[Killed] BooleanLiteral
main/pages/UCSBDates/UCSBDatesCreatePage.jsx:7:59
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBDatesCreatePage({ storybook = false }) {
+export default function UCSBDatesCreatePage({ storybook = true }) {
   const objectToAxiosParams = (ucsbDate) => ({
     url: "/api/ucsbdates/post",
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdates"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBDates/UCSBDatesCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBDatesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsbDate) => ({
-    url: "/api/ucsbdates/post",
-    method: "POST",
-    params: {
-      quarterYYYYQ: ucsbDate.quarterYYYYQ,
-      name: ucsbDate.name,
-      localDateTime: ucsbDate.localDateTime,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbDate) => {
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesCreatePage.jsx:8:46
 import { toast } from "react-toastify";
 
 export default function UCSBDatesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsbDate) => ({
-    url: "/api/ucsbdates/post",
-    method: "POST",
-    params: {
-      quarterYYYYQ: ucsbDate.quarterYYYYQ,
-      name: ucsbDate.name,
-      localDateTime: ucsbDate.localDateTime,
-    },
-  });
+  const objectToAxiosParams = (ucsbDate) => ({});
 
   const onSuccess = (ucsbDate) => {
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/UCSBDates/UCSBDatesCreatePage.jsx:10:13
 export default function UCSBDatesCreatePage({ storybook = false }) {
   const objectToAxiosParams = (ucsbDate) => ({
     url: "/api/ucsbdates/post",
-    method: "POST",
+    method: "",
     params: {
       quarterYYYYQ: ucsbDate.quarterYYYYQ,
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesCreatePage.jsx:18:35
     },
   });
 
-  const onSuccess = (ucsbDate) => {
-    toast(`New ucsbDate Created - id: ${ucsbDate.id} name: ${ucsbDate.name}`);
-  };
+  const onSuccess = (ucsbDate) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbDate Created - id: 17 name: Groundhog Day"

Number of calls: 0
