[Killed] BooleanLiteral
main/pages/UCSBDates/UCSBDatesEditPage.jsx:8:57
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBDatesEditPage({ storybook = false }) {
+export default function UCSBDatesEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdates"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsbdates?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsbdates`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBDatesEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/ucsbdates`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: UCSBDatesEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBDates/UCSBDatesEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDate) => ({
-    url: "/api/ucsbdates",
-    method: "PUT",
-    params: {
-      id: ucsbDate.id,
-    },
-    data: {
-      quarterYYYYQ: ucsbDate.quarterYYYYQ,
-      name: ucsbDate.name,
-      localDateTime: ucsbDate.localDateTime,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbDate) => {
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate Updated - id: 17 name: Christmas Morning"
Received: "Error: Request failed with status code 404"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.jsx:31:13
   const objectToAxiosPutParams = (ucsbDate) => ({
     url: "/api/ucsbdates",
     method: "PUT",
-    params: {
-      id: ucsbDate.id,
-    },
+    params: {},
     data: {
       quarterYYYYQ: ucsbDate.quarterYYYYQ,
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesEditPage.jsx:41:35
     },
   });
 
-  const onSuccess = (ucsbDate) => {
-    toast(`UCSBDate Updated - id: ${ucsbDate.id} name: ${ucsbDate.name}`);
-  };
+  const onSuccess = (ucsbDate) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/UCSBDates/UCSBDatesEditPage.jsx:42:11
   });
 
   const onSuccess = (ucsbDate) => {
-    toast(`UCSBDate Updated - id: ${ucsbDate.id} name: ${ucsbDate.name}`);
+    toast(``);
   };
 
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate Updated - id: 17 name: Christmas Morning"
Received: ""

Number of calls: 1

[Killed] LogicalOperator
main/pages/UCSBDates/UCSBDatesEditPage.jsx:58:7
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
+  if (isSuccess || !storybook) {
     return <Navigate to="/ucsbdates" />;
   }
killedBy: UCSBDatesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: Unable to find an element with the text: Edit UCSBDate. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
main/pages/UCSBDates/UCSBDatesEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
-        {ucsbDate && (
-          <UCSBDateForm
-            initialContents={ucsbDate}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {ucsbDate || <UCSBDateForm initialContents={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: UCSBDatesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBDateForm-quarterYYYYQ" id="quarterYYYYQ" name="quarterYYYYQ" type="text" /> instead

[Killed] ConditionalExpression
main/pages/UCSBDates/UCSBDatesEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
-        {ucsbDate && (
-          <UCSBDateForm
-            initialContents={ucsbDate}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBDatesEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
