[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesIndexPage.jsx:12:30
 export default function UCSBDatesIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbdates/create"
-          style={{ float: "right" }}
-        >
-          Create UCSBDate
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: UCSBDatesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBDate/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/UCSBDates/UCSBDatesIndexPage.jsx:13:9
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
+    if (false) {
       return (
         <Button
killedBy: UCSBDatesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBDate/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesIndexPage.jsx:13:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbdates/create"
-          style={{ float: "right" }}
-        >
-          Create UCSBDate
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: UCSBDatesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBDate/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesIndexPage.jsx:33:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsbdates/all"],
-    { method: "GET", url: "/api/ucsbdates/all" },
+    {},
     [],
   );
killedBy: UCSBDatesIndexPage tests renders three dates correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/UCSBDates/UCSBDatesIndexPage.jsx:33:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/ucsbdates/all"],
-    { method: "GET", url: "/api/ucsbdates/all" },
+    { method: "GET", url: "" },
     [],
   );
killedBy: UCSBDatesIndexPage tests renders three dates correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
