[Killed] BooleanLiteral
src/main/utils/useBackend.js:32:20
   queryKey,
   axiosParameters,
   initialData,
-  suppressToasts = false,
+  suppressToasts = true,
 ) {
   return useQuery({
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error communicating with backend via GET on /api/admin/users"

Number of calls: 0

[Killed] BlockStatement
src/main/utils/useBackend.js:33:3
   axiosParameters,
   initialData,
   suppressToasts = false,
-) {
-  return useQuery({
-    queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
-    initialData: initialData,
-  });
-}
+) {}
 
 const wrappedParams = async (params) => {
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Killed] ObjectLiteral
src/main/utils/useBackend.js:34:19
   initialData,
   suppressToasts = false,
 ) {
-  return useQuery({
-    queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
-    initialData: initialData,
-  });
+  return useQuery({});
 }
 
killedBy: UCSBDatesIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/main/utils/useBackend.js:36:26
 ) {
   return useQuery({
     queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
+    queryFn: async () => {},
     initialData: initialData,
   });
killedBy: RestaurantIndexPage tests renders three restaurants correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/utils/useBackend.js:37:11
   return useQuery({
     queryKey: queryKey,
     queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
+      try {} catch (e) {
         const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
         if (!suppressToasts) {
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/admin/users"
Received string:    "Query data cannot be undefined. Please make sure to return a value other than undefined from your query function. Affected query key: [\"/api/admin/users\"]"

[Killed] BlockStatement
src/main/utils/useBackend.js:40:19
       try {
         const response = await axios(axiosParameters);
         return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
-        console.error(errorMessage, e);
-        throw e;
-      }
+      } catch (e) {}
     },
     initialData: initialData,
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/admin/users"
Received string:    "Query data cannot be undefined. Please make sure to return a value other than undefined from your query function. Affected query key: [\"/api/admin/users\"]"

[Killed] ConditionalExpression
src/main/utils/useBackend.js:42:13
         return response.data;
       } catch (e) {
         const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
+        if (false) {
           toast(errorMessage);
         }
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error communicating with backend via GET on /api/admin/users"

Number of calls: 0

[Killed] BooleanLiteral
src/main/utils/useBackend.js:42:13
         return response.data;
       } catch (e) {
         const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
+        if (suppressToasts) {
           toast(errorMessage);
         }
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error communicating with backend via GET on /api/admin/users"

Number of calls: 0

[Killed] BlockStatement
src/main/utils/useBackend.js:53:41
   });
 }
 
-const wrappedParams = async (params) => {
-  return await (
-    await axios(params)
-  ).data;
-};
+const wrappedParams = async (params) => {};
 
 export function useBackendMutation(
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate Updated - id: 17 name: Christmas Morning"
Received: "TypeError: Cannot read properties of undefined (reading 'id')"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/useBackend.js:63:3
   objectToAxiosParams,
   useMutationParams,
   queryKey = null,
-) {
-  const queryClient = useQueryClient();
-
-  return useMutation({
-    mutationFn: (object) => wrappedParams(objectToAxiosParams(object)),
-    onError: (data) => {
-      toast(`${data}`);
-    },
-    // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null)
-        queryClient.invalidateQueries({ queryKey: queryKey });
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
-}
+) {}
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')

[Killed] ArrowFunction
src/main/utils/useBackend.js:67:17
   const queryClient = useQueryClient();
 
   return useMutation({
-    mutationFn: (object) => wrappedParams(objectToAxiosParams(object)),
+    mutationFn: () => undefined,
     onError: (data) => {
       toast(`${data}`);
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New ucsbDate Created - id: 17 name: Groundhog Day"
Received: "TypeError: Cannot read properties of undefined (reading 'id')"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/useBackend.js:68:24
 
   return useMutation({
     mutationFn: (object) => wrappedParams(objectToAxiosParams(object)),
-    onError: (data) => {
-      toast(`${data}`);
-    },
+    onError: (data) => {},
     // Stryker disable all: Not sure how to set up the complex behavior needed to test this
     onSettled: () => {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/useBackend.js:69:13
   return useMutation({
     mutationFn: (object) => wrappedParams(objectToAxiosParams(object)),
     onError: (data) => {
-      toast(`${data}`);
+      toast(``);
     },
     // Stryker disable all: Not sure how to set up the complex behavior needed to test this
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: Request failed with status code 404"
Received: ""

Number of calls: 1

[Killed] BooleanLiteral
src/main/utils/useBackend.js:77:12
         queryClient.invalidateQueries({ queryKey: queryKey });
     },
     // Stryker restore all
-    retry: false,
+    retry: true,
     ...useMutationParams,
   });
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
