[Killed] BlockStatement
main/components/Common/SortCaret.jsx:1:38
-export function getSortCaret(header) {
-  if (!header.column.getCanSort()) return "";
-  if (header.column.getIsSorted() === "asc") {
-    return "🔼";
-  }
-  if (header.column.getIsSorted() === "desc") {
-    return "🔽";
-  }
-  return "";
-}
+export function getSortCaret(header) {}
 
 export default function SortCaret({ header, testId = "testid" }) {
killedBy: SortCaret tests Up arrow when sorted asc
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔼
Received:

[Killed] BooleanLiteral
main/components/Common/SortCaret.jsx:2:7
 export function getSortCaret(header) {
-  if (!header.column.getCanSort()) return "";
+  if (header.column.getCanSort()) return "";
   if (header.column.getIsSorted() === "asc") {
     return "🔼";
killedBy: SortCaret tests Up arrow when sorted asc
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔼
Received:

[Killed] ConditionalExpression
main/components/Common/SortCaret.jsx:2:7
 export function getSortCaret(header) {
-  if (!header.column.getCanSort()) return "";
+  if (false) return "";
   if (header.column.getIsSorted() === "asc") {
     return "🔼";
killedBy: SortCaret tests Empty when cannot sort
statusReason: TypeError: header.column.getIsSorted is not a function

[Killed] BlockStatement
main/components/Common/SortCaret.jsx:3:46
 export function getSortCaret(header) {
   if (!header.column.getCanSort()) return "";
-  if (header.column.getIsSorted() === "asc") {
-    return "🔼";
-  }
+  if (header.column.getIsSorted() === "asc") {}
   if (header.column.getIsSorted() === "desc") {
     return "🔽";
killedBy: SortCaret tests Up arrow when sorted asc
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔼
Received:

[Killed] ConditionalExpression
main/components/Common/SortCaret.jsx:3:7
 export function getSortCaret(header) {
   if (!header.column.getCanSort()) return "";
-  if (header.column.getIsSorted() === "asc") {
+  if (true) {
     return "🔼";
   }
killedBy: SortCaret tests Empty when is not sorted
statusReason: Error: expect(element).toBeEmptyDOMElement()

Received:
  "🔼"

[Killed] StringLiteral
main/components/Common/SortCaret.jsx:4:12
 export function getSortCaret(header) {
   if (!header.column.getCanSort()) return "";
   if (header.column.getIsSorted() === "asc") {
-    return "🔼";
+    return ""
   }
   if (header.column.getIsSorted() === "desc") {
killedBy: SortCaret tests Up arrow when sorted asc
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔼
Received:

[Killed] ConditionalExpression
main/components/Common/SortCaret.jsx:6:7
   if (header.column.getIsSorted() === "asc") {
     return "🔼";
   }
-  if (header.column.getIsSorted() === "desc") {
+  if (true) {
     return "🔽";
   }
killedBy: OurTable tests OurTable component tests click on a header and a sort caret should appear
statusReason: Error: expect(element).toBeEmptyDOMElement()

Received:
  "🔽"

[Killed] BlockStatement
main/components/Common/SortCaret.jsx:6:47
   if (header.column.getIsSorted() === "asc") {
     return "🔼";
   }
-  if (header.column.getIsSorted() === "desc") {
-    return "🔽";
-  }
+  if (header.column.getIsSorted() === "desc") {}
   return "";
 }
killedBy: SortCaret tests Down arrow when desc
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] StringLiteral
main/components/Common/SortCaret.jsx:7:12
     return "🔼";
   }
   if (header.column.getIsSorted() === "desc") {
-    return "🔽";
+    return ""
   }
   return "";
killedBy: SortCaret tests Down arrow when desc
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] BlockStatement
main/components/Common/SortCaret.jsx:12:66
   return "";
 }
 
-export default function SortCaret({ header, testId = "testid" }) {
-  return (
-    <span data-testid={`${testId}-header-${header.column.id}-sort-carets`}>
-      {getSortCaret(header)}
-    </span>
-  );
-}
+export default function SortCaret({ header, testId = "testid" }) {}
 
killedBy: SortCaret tests Up arrow when sorted asc
statusReason: Error: Unable to find an element by: [data-testid="testid-header-testColumn-sort-carets"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Common/SortCaret.jsx:12:54
   return "";
 }
 
-export default function SortCaret({ header, testId = "testid" }) {
+export default function SortCaret({ header, testId = "" }) {
   return (
     <span data-testid={`${testId}-header-${header.column.id}-sort-carets`}>
killedBy: SortCaret tests Up arrow when sorted asc
statusReason: Error: Unable to find an element by: [data-testid="testid-header-testColumn-sort-carets"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      data-testid="-header-testColumn-sort-carets"
    >

[Killed] StringLiteral
main/components/Common/SortCaret.jsx:14:24
 
 export default function SortCaret({ header, testId = "testid" }) {
   return (
-    <span data-testid={`${testId}-header-${header.column.id}-sort-carets`}>
+    <span data-testid={``}>
       {getSortCaret(header)}
     </span>
killedBy: SortCaret tests Up arrow when sorted asc
statusReason: Error: Unable to find an element by: [data-testid="testid-header-testColumn-sort-carets"]

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      data-testid=""
    >
