[Killed] BlockStatement
main/components/Profile/RoleBadge.jsx:3:58
 import { Badge } from "react-bootstrap";
 
-export default function RoleBadge({ role, currentUser }) {
-  const roles = currentUser.root.roles.map((o) => o.authority);
-
-  const lcrole = role.replace("ROLE_", "").toLowerCase();
-  return roles.includes(role) ? (
-    <Badge className="bg-primary" data-testid={`role-badge-${lcrole}`}>
-      {lcrole}
-    </Badge>
-  ) : (
-    <span data-testid={`role-missing-${lcrole}`}></span>
-  );
-}
+export default function RoleBadge({ role, currentUser }) {}
 
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Profile/RoleBadge.jsx:4:44
 import { Badge } from "react-bootstrap";
 
 export default function RoleBadge({ role, currentUser }) {
-  const roles = currentUser.root.roles.map((o) => o.authority);
+  const roles = currentUser.root.roles.map(() => undefined);
 
   const lcrole = role.replace("ROLE_", "").toLowerCase();
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
