[Killed] StringLiteral
main/components/Users/UsersTable.jsx:6:18
 const columns = [
   {
     header: "id",
-    accessorKey: "id", // accessor is the "key" in the data
+    accessorKey: "", // accessor is the "key" in the data
   },
   {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:8:3
     header: "id",
     accessorKey: "id", // accessor is the "key" in the data
   },
-  {
-    header: "First Name",
-    accessorKey: "givenName",
-  },
+  {},
   {
     header: "Last Name",
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:12:3
     header: "First Name",
     accessorKey: "givenName",
   },
-  {
-    header: "Last Name",
-    accessorKey: "familyName",
-  },
+  {},
   {
     header: "Email",
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:16:3
     header: "Last Name",
     accessorKey: "familyName",
   },
-  {
-    header: "Email",
-    accessorKey: "email",
-  },
+  {},
   {
     header: "Admin",
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:17:13
     accessorKey: "familyName",
   },
   {
-    header: "Email",
+    header: "",
     accessorKey: "email",
   },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UsersTable"

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:18:18
   },
   {
     header: "Email",
-    accessorKey: "email",
+    accessorKey: "",
   },
   {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UsersTable"

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:20:3
     header: "Email",
     accessorKey: "email",
   },
-  {
-    header: "Admin",
-    id: "admin",
-    accessorKey: "admin",
-    cell: ({ cell }) => {
-      return String(cell.getValue());
-    }, // convert boolean to string for display
-  },
+  {},
 ];
 
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Error: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:22:9
   },
   {
     header: "Admin",
-    id: "admin",
+    id: "",
     accessorKey: "admin",
     cell: ({ cell }) => {
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:24:25
     header: "Admin",
     id: "admin",
     accessorKey: "admin",
-    cell: ({ cell }) => {
-      return String(cell.getValue());
-    }, // convert boolean to string for display
+    cell: ({ cell }) => {}, // convert boolean to string for display
   },
 ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:30:47
   },
 ];
 
-export default function UsersTable({ users }) {
-  return <OurTable data={users} columns={columns} testid={"UsersTable"} />;
-}
+export default function UsersTable({ users }) {}
 
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
