[Killed] ConditionalExpression
src/main/pages/ProfilePage.jsx:10:7
 const ProfilePage = () => {
   const currentUser = useCurrentUser();
 
-  if (!currentUser.loggedIn) {
+  if (true) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: /Welcome/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Not logged in.
    </p>

[Killed] BlockStatement
src/main/pages/ProfilePage.jsx:10:30
 const ProfilePage = () => {
   const currentUser = useCurrentUser();
 
-  if (!currentUser.loggedIn) {
-    return <p>Not logged in.</p>;
-  }
+  if (!currentUser.loggedIn) {}
 
   const { email, pictureUrl, fullName } = currentUser.root.user;
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] StringLiteral
src/main/pages/ProfilePage.jsx:30:28
           <p className="lead text-muted">{email}</p>
           <RoleBadge role={"ROLE_USER"} currentUser={currentUser} />
           <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser} />
-          <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser} />
+          <RoleBadge role={""} currentUser={currentUser} />
         </Col>
       </Row>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-admin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
