[Killed] BlockStatement
src/main/utils/UCSBDateUtils.js:3:42
 import { toast } from "react-toastify";
 
-export function onDeleteSuccess(message) {
-  console.log(message);
-  toast(message);
-}
+export function onDeleteSuccess(message) {}
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: UCSBDatesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate with id 1 was deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/main/utils/UCSBDateUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsbdates",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBDatesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate with id 1 was deleted"
Received: "Error: Request failed with status code 404"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
src/main/utils/UCSBDateUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/ucsbdates",
+    url: "",
     method: "DELETE",
     params: {
killedBy: UCSBDatesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate with id 1 was deleted"
Received: "Error: Request failed with status code 404"

Number of calls: 1

Ignored nodes: comments, script, style
