[Killed] BlockStatement
src/main/utils/currentUser.js:9:26
   let rolesList = ["ERROR_GETTING_ROLES"];
   const queryResults = useQuery({
     queryKey: ["current user"],
-    queryFn: async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        if (e.status === 403) {
-          return { loggedIn: false, root: {} };
-        } else {
-          console.error("Error invoking axios.get: ", e);
-          throw e;
-        }
-      }
-    },
+    queryFn: async () => {},
     initialData: { loggedIn: false, root: null, initialData: true },
   });
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Error invoking axios.get:/
Received string:  "Query data cannot be undefined. Please make sure to return a value other than undefined from your query function. Affected query key: [\"current user\"]"

[Killed] BlockStatement
src/main/utils/currentUser.js:10:11
   const queryResults = useQuery({
     queryKey: ["current user"],
     queryFn: async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
+      try {} catch (e) {
         if (e.status === 403) {
           return { loggedIn: false, root: {} };
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Error invoking axios.get:/
Received string:  "Query data cannot be undefined. Please make sure to return a value other than undefined from your query function. Affected query key: [\"current user\"]"

[Killed] ObjectLiteral
src/main/utils/currentUser.js:17:25
         } catch (e) {
           console.error("Error getting roles: ", e);
         }
-        response.data = { ...response.data, rolesList: rolesList };
+        response.data = {};
         return { loggedIn: true, root: response.data };
       } catch (e) {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves data from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 45
+ Received  +  1

  Object {
    "loggedIn": true,
-   "root": Object {

[Killed] BooleanLiteral
src/main/utils/currentUser.js:18:28
           console.error("Error getting roles: ", e);
         }
         response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
+        return { loggedIn: false, root: response.data };
       } catch (e) {
         if (e.status === 403) {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves data from API
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "loggedIn": true,

[Killed] BlockStatement
src/main/utils/currentUser.js:19:19
         }
         response.data = { ...response.data, rolesList: rolesList };
         return { loggedIn: true, root: response.data };
-      } catch (e) {
-        if (e.status === 403) {
-          return { loggedIn: false, root: {} };
-        } else {
-          console.error("Error invoking axios.get: ", e);
-          throw e;
-        }
-      }
+      } catch (e) {}
     },
     initialData: { loggedIn: false, root: null, initialData: true },
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Error invoking axios.get:/
Received string:  "Query data cannot be undefined. Please make sure to return a value other than undefined from your query function. Affected query key: [\"current user\"]"

[Killed] ConditionalExpression
src/main/utils/currentUser.js:20:13
         response.data = { ...response.data, rolesList: rolesList };
         return { loggedIn: true, root: response.data };
       } catch (e) {
-        if (e.status === 403) {
+        if (true) {
           return { loggedIn: false, root: {} };
         } else {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/currentUser.js:20:31
         response.data = { ...response.data, rolesList: rolesList };
         return { loggedIn: true, root: response.data };
       } catch (e) {
-        if (e.status === 403) {
-          return { loggedIn: false, root: {} };
-        } else {
+        if (e.status === 403) {} else {
           console.error("Error invoking axios.get: ", e);
           throw e;
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser when API returns 403 (not logged in)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/main/utils/currentUser.js:21:30
         return { loggedIn: true, root: response.data };
       } catch (e) {
         if (e.status === 403) {
-          return { loggedIn: false, root: {} };
+          return { loggedIn: true, root: {} };
         } else {
           console.error("Error invoking axios.get: ", e);
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser when API returns 403 (not logged in)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "loggedIn": false,
+   "loggedIn": true,

[Killed] ObjectLiteral
src/main/utils/currentUser.js:21:18
         return { loggedIn: true, root: response.data };
       } catch (e) {
         if (e.status === 403) {
-          return { loggedIn: false, root: {} };
+          return {};
         } else {
           console.error("Error invoking axios.get: ", e);
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser when API returns 403 (not logged in)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "loggedIn": false,
-   "root": Object {},

[Killed] BlockStatement
src/main/utils/currentUser.js:22:16
       } catch (e) {
         if (e.status === 403) {
           return { loggedIn: false, root: {} };
-        } else {
-          console.error("Error invoking axios.get: ", e);
-          throw e;
-        }
+        } else {}
       }
     },
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Error invoking axios.get:/
Received string:  "Query data cannot be undefined. Please make sure to return a value other than undefined from your query function. Affected query key: [\"current user\"]"

[Killed] StringLiteral
src/main/utils/currentUser.js:23:25
         if (e.status === 403) {
           return { loggedIn: false, root: {} };
         } else {
-          console.error("Error invoking axios.get: ", e);
+          console.error("", e);
           throw e;
         }
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Error invoking axios.get:/
Received string:  ""

[Killed] BooleanLiteral
src/main/utils/currentUser.js:28:30
         }
       }
     },
-    initialData: { loggedIn: false, root: null, initialData: true },
+    initialData: { loggedIn: true, root: null, initialData: true },
   });
   return queryResults.data;
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "initialData": true,
-   "loggedIn": false,

[Killed] BooleanLiteral
src/main/utils/currentUser.js:28:62
         }
       }
     },
-    initialData: { loggedIn: false, root: null, initialData: true },
+    initialData: { loggedIn: false, root: null, initialData: false },
   });
   return queryResults.data;
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "initialData": true,
+   "initialData": false,

[Killed] BlockStatement
src/main/utils/currentUser.js:33:29
   return queryResults.data;
 }
 
-export function useLogout() {
-  const queryClient = useQueryClient();
-  const navigate = useNavigate();
-  const mutation = useMutation({
-    mutationFn: async () => {
-      await axios.post("/logout");
-      await queryClient.resetQueries({ queryKey: ["current user"] });
-      navigate("/");
-    },
-  });
-  return mutation;
-}
+export function useLogout() {}
 
 export function hasRole(currentUser, role) {
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/main/utils/currentUser.js:37:29
   const queryClient = useQueryClient();
   const navigate = useNavigate();
   const mutation = useMutation({
-    mutationFn: async () => {
-      await axios.post("/logout");
-      await queryClient.resetQueries({ queryKey: ["current user"] });
-      navigate("/");
-    },
+    mutationFn: async () => {},
   });
   return mutation;
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
src/main/utils/currentUser.js:38:24
   const navigate = useNavigate();
   const mutation = useMutation({
     mutationFn: async () => {
-      await axios.post("/logout");
+      await axios.post("");
       await queryClient.resetQueries({ queryKey: ["current user"] });
       navigate("/");
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
src/main/utils/currentUser.js:39:51
   const mutation = useMutation({
     mutationFn: async () => {
       await axios.post("/logout");
-      await queryClient.resetQueries({ queryKey: ["current user"] });
+      await queryClient.resetQueries({ queryKey: [""] });
       navigate("/");
     },
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "queryKey": Array [
-     "current user",

[Killed] ObjectLiteral
src/main/utils/currentUser.js:39:38
   const mutation = useMutation({
     mutationFn: async () => {
       await axios.post("/logout");
-      await queryClient.resetQueries({ queryKey: ["current user"] });
+      await queryClient.resetQueries({});
       navigate("/");
     },
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "queryKey": Array [
-     "current user",

[Killed] StringLiteral
src/main/utils/currentUser.js:40:16
     mutationFn: async () => {
       await axios.post("/logout");
       await queryClient.resetQueries({ queryKey: ["current user"] });
-      navigate("/");
+      navigate("");
     },
   });
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/utils/currentUser.js:46:44
   return mutation;
 }
 
-export function hasRole(currentUser, role) {
-  if (currentUser == null) return false;
-
-  return currentUser.root?.rolesList?.includes(role);
-}
+export function hasRole(currentUser, role) {}
 
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/main/utils/currentUser.js:47:7
 }
 
 export function hasRole(currentUser, role) {
-  if (currentUser == null) return false;
+  if (false) return false;
 
   return currentUser.root?.rolesList?.includes(role);
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: TypeError: Cannot read properties of null (reading 'root')

[Killed] BooleanLiteral
src/main/utils/currentUser.js:47:35
 }
 
 export function hasRole(currentUser, role) {
-  if (currentUser == null) return false;
+  if (currentUser == null) return true;
 
   return currentUser.root?.rolesList?.includes(role);
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: Error: expect(received).toBeFalsy()

Received: true
