[Killed] BlockStatement
src/main/utils/systemInfo.js:4:33
 import { useQuery } from "@tanstack/react-query";
 import axios from "axios";
 
-export function useSystemInfo() {
-  return useQuery({
-    queryKey: ["systemInfo"],
-    queryFn: async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
-    },
-    initialData: {
-      initialData: true,
-      springH2ConsoleEnabled: false,
-      showSwaggerUILink: false,
-    },
-  });
-}
+export function useSystemInfo() {}
 
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _systemInfo.useSystemInfo)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/systemInfo.js:7:26
 export function useSystemInfo() {
   return useQuery({
     queryKey: ["systemInfo"],
-    queryFn: async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
-    },
+    queryFn: async () => {},
     initialData: {
       initialData: true,
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Error invoking axios.get:/
Received string:  "Query data cannot be undefined. Please make sure to return a value other than undefined from your query function. Affected query key: [\"systemInfo\"]"

[Killed] BlockStatement
src/main/utils/systemInfo.js:8:11
   return useQuery({
     queryKey: ["systemInfo"],
     queryFn: async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
+      try {} catch (e) {
         console.error("Error invoking axios.get: ", e);
         return {};
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Error invoking axios.get:/
Received string:  "Query data cannot be undefined. Please make sure to return a value other than undefined from your query function. Affected query key: [\"systemInfo\"]"

[Killed] BlockStatement
src/main/utils/systemInfo.js:11:19
       try {
         const response = await axios.get("/api/systemInfo");
         return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
+      } catch (e) {}
     },
     initialData: {
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Error invoking axios.get:/
Received string:  "Query data cannot be undefined. Please make sure to return a value other than undefined from your query function. Affected query key: [\"systemInfo\"]"

[Killed] BooleanLiteral
src/main/utils/systemInfo.js:19:26
     initialData: {
       initialData: true,
       springH2ConsoleEnabled: false,
-      showSwaggerUILink: false,
+      showSwaggerUILink: true,
     },
   });
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "initialData": true,
-   "showSwaggerUILink": false,
