[Killed] BlockStatement
src/main/utils/systemInfo.js:4:33
 import { useQuery } from "@tanstack/react-query";
 import axios from "axios";
 
-export function useSystemInfo() {
-  return useQuery({
-    queryKey: ["systemInfo"],
-    queryFn: async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
-    },
-    initialData: {
-      initialData: true,
-      springH2ConsoleEnabled: true,
-      showSwaggerUILink: true,
-    },
-  });
-}
+export function useSystemInfo() {}
 
killedBy: UCSBDatesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Cannot destructure property 'data' of '(0 , useSystemInfo)(...)' as it is undefined.

[Killed] BooleanLiteral
src/main/utils/systemInfo.js:18:31
     },
     initialData: {
       initialData: true,
-      springH2ConsoleEnabled: true,
+      springH2ConsoleEnabled: false,
       showSwaggerUILink: true,
     },
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: expected { initialData: true, …(2) } to deeply equal { initialData: true, …(2) }

[Killed] BooleanLiteral
src/main/utils/systemInfo.js:19:26
     initialData: {
       initialData: true,
       springH2ConsoleEnabled: true,
-      showSwaggerUILink: true,
+      showSwaggerUILink: false,
     },
   });
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: expected { initialData: true, …(2) } to deeply equal { initialData: true, …(2) }
